---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.#ctor(Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings)
source: html/edcd1ef9-d7a0-a0d2-da4b-027e01da58aa.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.#ctor Method

Constructs a new copy of the input AnalysisDisplayColoredSurfaceSettings object.

## Syntax (C#)
```csharp
public AnalysisDisplayColoredSurfaceSettings(
	AnalysisDisplayColoredSurfaceSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null